public class Task1 {
    public static void main(String[] args) {
        //Составьте программу, выводящую на экран квадраты чисел от 1 до 25.
        for(int i = 1; i <= 25; i++) {
            System.out.println(i*i);
        }
    }
}